{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of summarized descriptions for various frontend files covering catalog logic, UI components, branding styles, and utilities.",
  "frontend/index.css": "Tailwind base setup defining light/dark CSS variables and applying global background and border styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component rendering public and admin tabs, handling catalog loading and item creation.",
  "frontend/src/components/admin/AdminArea.tsx": "Admin container combining banner manager, upload form, and catalog manager.",
  "frontend/src/components/admin/AdminBannerManager.tsx": "Admin tool for uploading, validating, saving, and removing a fixed‑size banner image.",
  "frontend/src/components/admin/AdminCatalogManager.tsx": "Table UI listing catalog items with remove actions and basic type display.",
  "frontend/src/components/admin/AdminGate.tsx": "Login gate enforcing admin authentication and showing logout and protected content when unlocked.",
  "frontend/src/components/admin/AdminUploadForm.tsx": "Form component allowing admins to input item details, validate media URLs, and submit new catalog entries. Handles label selection, media type selection, and basic URL checks.",
  "frontend/src/components/layout/Background.tsx": "Renders a fixed background image with a gradient overlay for the app layout.",
  "frontend/src/components/layout/MasparLayout.tsx": "Main layout wrapper providing header, background, content container, and footer with social links and branding. Wraps all public-facing pages.",
  "frontend/src/components/public/CollectionCards.tsx": "Displays a grid of collection cards showing name, icon, and item count, allowing users to select a collection.",
  "frontend/src/components/public/ItemGrid.tsx": "Renders catalog items in a responsive grid with media-type icons, thumbnails, and click handling. Applies content protection and supports multiple media types.",
  "frontend/src/components/public/PublicViewer.tsx": "Public catalog viewer with banner display, search, filtering, item grid, and modal viewer integration. Manages search, label filter, modal state, and banner updates.",
  "frontend/src/components/public/SearchAndFilters.tsx": "Provides search input and label filter dropdown with thumbnails for refining visible catalog items.",
  "frontend/src/components/viewers/ImageZoomViewer.tsx": "Zoomable and rotatable image viewer with controls for scale and rotation.",
  "frontend/src/components/viewers/MediaViewerModal.tsx": "Modal viewer that displays images, videos, or PDFs using the appropriate viewer component, with validation and content protection.",
  "frontend/src/components/viewers/PdfFirstPagePreview.tsx": "Displays the first page of a PDF in an iframe and shows an error message if loading fails.",
  "frontend/src/components/viewers/VideoViewer.tsx": "Renders a video player with controls and displays an error state if the video cannot load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCatalog.ts": "Loads, cleans, seeds, and manages catalog items with add, remove, and refresh helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and authentication context through a React provider.",
  "frontend/src/index.css": "Defines Tailwind base styling, theme variables for light/dark mode, and utility classes including glass effects and gradients.",
  "frontend/src/lib/adminAuth.ts": "Implements simple admin authentication using hardcoded credentials and localStorage state.",
  "frontend/src/lib/bannerStorage.ts": "Handles storing, retrieving, clearing, and synchronizing banner data across tabs using localStorage and custom events.",
  "frontend/src/lib/catalogStorage.ts": "Manages catalog persistence with sanitization, migration of legacy items, and CRUD helpers using localStorage.",
  "frontend/src/lib/catalogTypes.ts": "Defines catalog item types and a runtime type for handling legacy or malformed media types.",
  "frontend/src/lib/collections.ts": "Provides default collections and derives the effective collection list based on catalog usage.",
  "frontend/src/lib/contentProtection.ts": "Adds and removes handlers to block context menu and drag actions for content protection.",
  "frontend/src/lib/labelLanguage.ts": "Empty module placeholder for label language handling.",
  "frontend/src/lib/labelThumbnails.ts": "Maps predefined labels to thumbnail image paths and provides helpers to retrieve or check thumbnails.",
  "frontend/src/lib/predefinedLabels.ts": "Defines the set of predefined catalog labels and includes a validator for checking label validity.",
  "frontend/src/lib/seedCatalog.ts": "Defines an empty seed catalog and lists deprecated seed item IDs and titles for cleanup.",
  "frontend/src/lib/uiText.ts": "Provides all UI text strings for headers, navigation, admin screens, public viewer, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, components, animations, and plugins including typography and container queries.",
  "project_state.json": "Describes project state, requirements, known issues, architecture notes, and existing feature metadata."
}