{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping UI changes to specific frontend files and components with high-confidence traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, including styling, layout, admin tools, and catalog logic.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light/dark themes using OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with tabbed navigation between public viewer and admin area, wiring catalog state and authentication.",
  "frontend/src/components/admin/AdminArea.tsx": "Admin container combining banner manager, upload form, and catalog manager.",
  "frontend/src/components/admin/AdminBannerManager.tsx": "Admin tool for uploading, validating, saving, and removing a fixed‑size banner image with live state updates.",
  "frontend/src/components/admin/AdminCatalogManager.tsx": "Admin table listing catalog items with remove actions and no collection column.",
  "frontend/src/components/admin/AdminGate.tsx": "Login gate handling admin authentication, session persistence, and logout UI.",
  "frontend/src/components/admin/AdminUploadForm.tsx": "Provides an admin form to create catalog items with title, predefined label, media type, and media source, then submits via onAdd.",
  "frontend/src/components/layout/Background.tsx": "Renders a fixed background image with a gradient overlay.",
  "frontend/src/components/layout/MasparLayout.tsx": "Defines the main site layout with header, background, footer, and social links, wrapping page content.",
  "frontend/src/components/public/CollectionCards.tsx": "Displays selectable collection cards showing name, icon, and item count.",
  "frontend/src/components/public/ItemGrid.tsx": "Renders a grid of catalog items with thumbnails and media-type indicators, applying content protection and click handling.",
  "frontend/src/components/public/PublicViewer.tsx": "Combines banner display, search/filter controls, item grid, and media modal to browse public catalog items.",
  "frontend/src/components/public/SearchAndFilters.tsx": "Provides search input and label filter dropdown with label thumbnails.",
  "frontend/src/components/viewers/ImageZoomViewer.tsx": "Shows an image with zoom and rotation controls.",
  "frontend/src/components/viewers/MediaViewerModal.tsx": "Modal that displays image, video, or PDF viewers for a selected catalog item with content protection.",
  "frontend/src/components/viewers/PdfFirstPagePreview.tsx": "Embeds an iframe to display the first page of a PDF.",
  "frontend/src/components/viewers/VideoViewer.tsx": "Renders a video player with download disabled.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using react-query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCatalog.ts": "Loads, cleans, seeds, and manages catalog items in localStorage with add, remove, and refresh helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity auth, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, dark mode, and utility classes including glassmorphism and interaction effects.",
  "frontend/src/lib/adminAuth.ts": "Implements simple admin auth using hardcoded credentials and localStorage-based unlock state.",
  "frontend/src/lib/bannerStorage.ts": "Stores, retrieves, clears, and syncs banner data in localStorage with custom events and cross-tab updates.",
  "frontend/src/lib/catalogStorage.ts": "Manages catalog persistence with legacy label migration plus CRUD helpers for catalog items.",
  "frontend/src/lib/catalogTypes.ts": "Defines the CatalogItem interface and supported media types.",
  "frontend/src/lib/collections.ts": "Provides default collections and derives the active set from catalog items while ensuring all defaults remain included.",
  "frontend/src/lib/contentProtection.ts": "Offers utilities to disable context menu and drag actions on elements to prevent content copying.",
  "frontend/src/lib/labelLanguage.ts": "Empty placeholder file.",
  "frontend/src/lib/labelThumbnails.ts": "Maps predefined labels to thumbnail image paths and provides helpers to fetch or check thumbnails.",
  "frontend/src/lib/predefinedLabels.ts": "Defines the full predefined label list and utilities to validate label strings.",
  "frontend/src/lib/seedCatalog.ts": "Contains an empty seed catalog and lists deprecated IDs and titles for cleanup logic.",
  "frontend/src/lib/uiText.ts": "Holds static UI text strings for headers, navigation, admin, public views, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended Maspar color palette, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current spec for a mobile-responsive Maspar sales portal, including UI/theme rules, localStorage-based catalog management, known issues, and existing feature metadata."
}