{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing admin export/import features, referenced files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including styles, config, storage, hooks, and components.",
  "frontend/index.css": "Tailwind base theme variables for light/dark modes plus global styling utilities.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app routing between public viewer and admin area using tabs and catalog state.",
  "frontend/src/components/admin/AdminArea.tsx": "Admin container showing storage notice, data transfer tools, banner manager, upload form, and catalog manager.",
  "frontend/src/components/admin/AdminBannerManager.tsx": "Admin tool to upload, validate, preview, and remove a 1280x720 banner image with LocalStorage sync.",
  "frontend/src/components/admin/AdminCatalogManager.tsx": "Admin table listing catalog items with remove actions and empty-state messaging.",
  "frontend/src/components/admin/AdminDataTransfer.tsx": "Provides UI for exporting and importing app data with confirmation dialogs and file handling.",
  "frontend/src/components/admin/AdminGate.tsx": "Implements an admin login gate with credential checking and logout functionality.",
  "frontend/src/components/admin/AdminUploadForm.tsx": "Form for adding catalog items with fields for title, label, media type, and media source validation.",
  "frontend/src/components/layout/Background.tsx": "Renders a fixed background image with a gradient overlay.",
  "frontend/src/components/layout/MasparLayout.tsx": "Page layout with header, background, footer, and social links wrapping all site content.",
  "frontend/src/components/public/CollectionCards.tsx": "Displays selectable collection cards showing icon, name, and item count.",
  "frontend/src/components/public/ItemGrid.tsx": "Shows catalog items in a grid with media-type icons, thumbnails, and click handling.",
  "frontend/src/components/public/PublicViewer.tsx": "Main public catalog view with search, filtering, banner display, item grid, and media modal.",
  "frontend/src/components/public/SearchAndFilters.tsx": "Renders a search bar and label filter dropdown with thumbnails for filtering items.",
  "frontend/src/components/viewers/ImageZoomViewer.tsx": "Provides zoom and rotation controls for viewing an image with adjustable scaling.",
  "frontend/src/components/viewers/MediaViewerModal.tsx": "Modal viewer that displays images, videos, or PDFs with validation and content protection.",
  "frontend/src/components/viewers/PdfFirstPagePreview.tsx": "Embeds the first page of a PDF via iframe and shows an error state on load failure.",
  "frontend/src/components/viewers/VideoViewer.tsx": "Plays a video with controls and shows an error message if the source fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and tracks a backend actor using the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCatalog.ts": "Loads, cleans, seeds, and manages a catalog with add/remove operations and cross-tab syncing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and loads saved identities.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, themes, and utility classes including glass effects and content protection.",
  "frontend/src/lib/adminAuth.ts": "Implements simple admin auth with hardcoded credentials and localStorage-based unlock state.",
  "frontend/src/lib/bannerStorage.ts": "Manages banner data in localStorage with load, save, clear, and cross-tab sync via custom events.",
  "frontend/src/lib/catalogStorage.ts": "Handles catalog persistence with sanitization, migration, and change broadcasting across tabs.",
  "frontend/src/lib/catalogTypes.ts": "Defines catalog item and media type interfaces, including a relaxed type for stored items.",
  "frontend/src/lib/collections.ts": "Provides default collections and returns active ones based on catalog content.",
  "frontend/src/lib/contentProtection.ts": "Disables context menu and drag actions on elements to prevent content copying.",
  "frontend/src/lib/dataTransfer.ts": "Implements catalog/banner export, import, validation, and item sanitization for data transfer.",
  "frontend/src/lib/labelLanguage.ts": "Empty placeholder file for label language handling.",
  "frontend/src/lib/labelThumbnails.ts": "Maps predefined labels to thumbnail paths and exposes lookup helpers.",
  "frontend/src/lib/predefinedLabels.ts": "Defines the fixed list of valid labels and utilities to check label validity.",
  "frontend/src/lib/seedCatalog.ts": "Exports an empty seed catalog and lists deprecated seed IDs and titles for cleanup.",
  "frontend/src/lib/uiText.ts": "Centralized UI text strings for headers, navigation, admin UI, public UI, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and authentication provider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with theme extensions, plugins, and custom colors.",
  "project_state.json": "Defines the project’s state, requirements, architecture notes, known issues, and existing features for a mobile‑responsive Maspar sales portal using HTML/CSS/JS with LocalStorage. Serves as the central specification for UI theme updates, login rules, content handling, and pending fixes."
}