{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for reference.",
  "frontend/index.css": "Tailwind base/styles with OKLCH CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app wiring public viewer and admin area with tabs and catalog state management.",
  "frontend/src/components/admin/AdminArea.tsx": "Admin container rendering the upload form and catalog manager.",
  "frontend/src/components/admin/AdminCatalogManager.tsx": "Admin table showing catalog items with delete actions and confirmation.",
  "frontend/src/components/admin/AdminGate.tsx": "Admin authentication wrapper handling login, logout, and session state.",
  "frontend/src/components/admin/AdminUploadForm.tsx": "Admin form for adding catalog items, including predefined label selection and bilingual label inputs.",
  "frontend/src/components/layout/Background.tsx": "Renders the global background image with gradient overlay.",
  "frontend/src/components/layout/MasparLayout.tsx": "Page layout with header, footer, social icons, and content wrapper using UI_TEXT and Background.",
  "frontend/src/components/public/CollectionCards.tsx": "Renders collection cards with icons and item counts, allowing selection highlighting.",
  "frontend/src/components/public/ItemGrid.tsx": "Displays catalog items in a grid with media icons, previews, and content protection.",
  "frontend/src/components/public/PublicViewer.tsx": "Main public catalog viewer with search, filtering, collections, item grid, and media modal.",
  "frontend/src/components/public/SearchAndFilters.tsx": "Search bar, collection filter, and language toggle for catalog browsing.",
  "frontend/src/components/viewers/ImageZoomViewer.tsx": "Image viewer with zoom and rotation controls.",
  "frontend/src/components/viewers/MediaViewerModal.tsx": "Modal showing image, video, or PDF viewers with content protection and escape handling.",
  "frontend/src/components/viewers/PdfFirstPagePreview.tsx": "Displays first-page PDF preview via iframe.",
  "frontend/src/components/viewers/VideoViewer.tsx": "Video player with controls and download restriction.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on Internet Identity with query invalidation.",
  "frontend/src/hooks/useCatalog.ts": "Manages catalog state with local storage loading, seeding, add/remove, and refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, loading stored identities, and exposing login state helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, glassmorphism utilities, transitions, and content‑protection CSS classes.",
  "frontend/src/lib/adminAuth.ts": "Implements simple admin authentication using hardcoded credentials and localStorage persistence.",
  "frontend/src/lib/catalogStorage.ts": "Manages catalog items in localStorage with load, save, add, remove, and update helpers.",
  "frontend/src/lib/catalogTypes.ts": "Defines types for catalog items, labels, media types, and language values.",
  "frontend/src/lib/collections.ts": "Provides default collections and a function to derive active collections from catalog data.",
  "frontend/src/lib/contentProtection.ts": "Adds and removes event listeners to disable context menu and drag actions on elements.",
  "frontend/src/lib/labelLanguage.ts": "Stores and retrieves the user’s label language preference (en/hi) from localStorage.",
  "frontend/src/lib/predefinedLabels.ts": "Contains a fixed list of predefined labels and a helper to validate them.",
  "frontend/src/lib/seedCatalog.ts": "Exports initial sample catalog items with bilingual labels and image sources.",
  "frontend/src/lib/uiText.ts": "Provides all static UI text strings for headers, navigation, admin, public viewer, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, shadows, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current state, features, requirements, and architectural notes."
}