{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature report mapping theme updates and hardcoded color cleanup to associated frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including styles, config, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base styles defining light/dark CSS variables for color tokens, radii, borders, and layout surfaces.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx into a root div.",
  "frontend/src/App.tsx": "Main app component combining layout, tabs, catalog loading, public viewer, and admin area with CRUD handlers.",
  "frontend/src/components/admin/AdminArea.tsx": "Admin container composing banner manager, upload form, and catalog manager.",
  "frontend/src/components/admin/AdminBannerManager.tsx": "Admin tool for uploading, validating, previewing, and removing a fixed‑size banner image with local storage persistence.",
  "frontend/src/components/admin/AdminCatalogManager.tsx": "Admin table listing catalog items with remove actions and confirmation prompts.",
  "frontend/src/components/admin/AdminGate.tsx": "Login gate enforcing admin authentication with credential check, session persistence, and logout handling.",
  "frontend/src/components/admin/AdminUploadForm.tsx": "A form component for admins to add catalog items with fields for metadata, labels, media type, and source.",
  "frontend/src/components/layout/Background.tsx": "Renders a fixed background image with a gradient overlay.",
  "frontend/src/components/layout/MasparLayout.tsx": "Defines the main app layout with background, header, footer, and social links wrapping page content.",
  "frontend/src/components/public/CollectionCards.tsx": "Displays selectable collection cards showing names, icons, and item counts.",
  "frontend/src/components/public/ItemGrid.tsx": "Renders a grid of catalog items with media previews and applies content protection.",
  "frontend/src/components/public/PublicViewer.tsx": "Main public catalog viewer with search, filters, collections, item grid, and media modal.",
  "frontend/src/components/public/SearchAndFilters.tsx": "Search bar and collection/language filter controls for public item browsing.",
  "frontend/src/components/viewers/ImageZoomViewer.tsx": "Image viewer with zoom and rotation controls.",
  "frontend/src/components/viewers/MediaViewerModal.tsx": "Modal that displays images, videos, or PDFs with content protection.",
  "frontend/src/components/viewers/PdfFirstPagePreview.tsx": "Shows a preview of the first page of a PDF via iframe.",
  "frontend/src/components/viewers/VideoViewer.tsx": "Simple video player with download restrictions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useCatalog.ts": "React hook managing catalog state, loading from localStorage, seeding defaults, and providing add/remove/refresh methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, handling login, stored identity, and status tracking.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, dark mode settings, and utility classes including glass effects and gradients.",
  "frontend/src/lib/adminAuth.ts": "Simple admin auth using hardcoded credentials and localStorage for tracking unlock state.",
  "frontend/src/lib/bannerStorage.ts": "LocalStorage CRUD utilities for storing and retrieving banner image metadata.",
  "frontend/src/lib/catalogStorage.ts": "LocalStorage persistence helpers for catalog items, including load, save, add, remove, and update.",
  "frontend/src/lib/catalogTypes.ts": "Type definitions for catalog items, labels, and media types.",
  "frontend/src/lib/collections.ts": "Default collection list and helper to merge catalog-derived collections with defaults.",
  "frontend/src/lib/contentProtection.ts": "Functions to disable context menus and drag events to protect content elements.",
  "frontend/src/lib/labelLanguage.ts": "LocalStorage helpers for storing and retrieving the selected label language.",
  "frontend/src/lib/predefinedLabels.ts": "List of allowed predefined labels and a type guard to validate them.",
  "frontend/src/lib/seedCatalog.ts": "Seed catalog entries used to initialize storage when empty.",
  "frontend/src/lib/uiText.ts": "Centralized UI text strings for headers, navigation, admin, public viewer, and footer.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, containers, shadows, and enabling plugins.",
  "project_state.json": "Defines the project’s current state, requirements, architectural constraints, known issues, and existing features for a CodePen‑ready HTML/CSS/JS Maspar sales portal. Marks this update as a fix request and outlines theme changes, localStorage usage, and UI/UX expectations."
}