{
  "kind": "build_request",
  "title": "Remove Collection UI from Admin page",
  "projectName": "Maspar Sales Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Remove the user-facing \"Collection\" field from the Admin upload form so Admin users cannot see or change any collection value when creating a catalog item.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remov Collestion from admin page"
        ]
      },
      "acceptanceCriteria": [
        "Admin Upload form no longer renders a \"Collection\" label/control anywhere on the Admin page.",
        "Submitting the Admin Upload form still succeeds and creates a valid catalog item (no runtime/type errors).",
        "A safe default collection value is applied internally (not shown in UI) so existing catalog data shape continues to work."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Remove the \"Collection\" column from the Admin catalog table so existing items no longer display collection values on the Admin page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remov Collestion from admin page"
        ]
      },
      "acceptanceCriteria": [
        "Admin catalog table header and rows no longer include a \"Collection\" column/cells.",
        "The table layout remains usable on mobile/desktop and Actions still work (Remove, etc.)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Update Admin user-facing text so the Admin area contains no visible \"Collection\" wording after removing the Collection UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remov Collestion from admin page"
        ]
      },
      "acceptanceCriteria": [
        "No Admin-page labels, headings, helper text, or table headers contain the word \"Collection\".",
        "All remaining Admin UI text is English-only and still reads clearly."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep best-effort content protection behaviors unchanged (no right-click / no drag) for existing media previews/viewers."
  ],
  "nonGoals": [
    "Do not redesign the Public Viewer filtering/organization as part of this change.",
    "Do not introduce backend persistence; continue using existing client-side/localStorage behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}