{
  "kind": "build_request",
  "title": "Fix media-type viewer not opening for catalog items",
  "projectName": "Maspar Sales Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Investigate and fix the issue where selecting a catalog item does not open the correct media viewer (Image/Video/PDF) in the Public Viewer, and ensure the modal reliably opens and stays open when an item card is clicked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Issu not Fixing in mesia Type, Not Opening"
        ]
      },
      "acceptanceCriteria": [
        "Clicking any item card in the Public Viewer always opens the MediaViewerModal.",
        "The modal does not immediately close after opening unless the user explicitly closes it (close button, clicking outside, or pressing Escape).",
        "The correct viewer component is rendered based on the item’s media type (image -> ImageZoomViewer, video -> VideoViewer, pdf -> PdfFirstPagePreview)."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Add a safe client-side compatibility cleanup/migration when loading catalog items from LocalStorage to prevent media viewers from failing due to invalid or legacy `mediaType` and/or missing `mediaSource` values (e.g., uppercase values like \"PDF\", unexpected strings, or empty URLs). Normalize known variants to supported values ('image' | 'video' | 'pdf') and handle unknown/invalid values gracefully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Issu not Fixing in mesia Type, Not Opening"
        ]
      },
      "acceptanceCriteria": [
        "Items loaded from LocalStorage with `mediaType` values such as \"PDF\", \"Video\", or \"Image\" are normalized to lowercase supported values so they can open in the modal.",
        "If an item has an unsupported/unknown `mediaType`, the modal opens and shows the existing English error UI for unsupported media types (instead of failing silently).",
        "If an item has an empty/invalid `mediaSource`, the modal opens and shows the existing English error UI for missing/invalid media source (instead of failing silently).",
        "No runtime errors occur in the catalog grid or modal when encountering malformed stored items."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not add new media types beyond image, video, and PDF.",
    "Do not introduce backend persistence for catalog items (remain LocalStorage-based).",
    "Do not change the admin credential model or authentication flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}