{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Maspar Sales Portal — Remove Collection UI from Admin page",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Remove Collection field from the Admin upload form while still applying an internal default collection value on submit.",
      "acceptanceCriteria": [
        "Admin Upload form no longer renders a \"Collection\" label/control anywhere on the Admin page.",
        "Submitting the Admin Upload form still succeeds and creates a valid catalog item (no runtime/type errors).",
        "A safe default collection value is applied internally (not shown in UI) so existing catalog data shape continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminUploadForm.tsx",
          "operation": "modify",
          "description": "Remove the user-facing Collection Label/Select from the form UI (currently using shadcn-ui Select). Keep the catalog item shape intact by applying a safe internal default collection value during submission (without rendering it). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Admin add-item handler continues to receive a valid collection value from the upload form after the Collection UI is removed (type-safety / runtime safety only; no behavior changes beyond defaulting)."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Remove the Collection column from the Admin catalog table while keeping actions and responsive layout usable.",
      "acceptanceCriteria": [
        "Admin catalog table header and rows no longer include a \"Collection\" column/cells.",
        "The table layout remains usable on mobile/desktop and Actions still work (Remove, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminCatalogManager.tsx",
          "operation": "modify",
          "description": "Update the shadcn-ui Table rendering to remove the Collection header and the per-row Collection cell while preserving the Actions column and horizontal scrolling behavior for mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Remove any remaining visible 'Collection' wording from Admin UI text after the Collection UI is removed.",
      "acceptanceCriteria": [
        "No Admin-page labels, headings, helper text, or table headers contain the word \"Collection\".",
        "All remaining Admin UI text is English-only and still reads clearly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/uiText.ts",
          "operation": "modify",
          "description": "Update centralized Admin UI text so no Admin-facing strings include the word \"Collection\" (e.g., remove/rename the admin form collection label text now that the UI is removed), while keeping remaining Admin text clear and English-only."
        },
        {
          "path": "frontend/src/components/admin/AdminCatalogManager.tsx",
          "operation": "modify",
          "description": "Ensure no hardcoded Admin table headers/cell labels include the word \"Collection\" after the column removal. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}