{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Maspar Sales Portal — Admin Export/Import Data Transfer (LocalStorage JSON)",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Add an Admin \"Data Transfer\" section to export all locally-stored catalog + banner data as a single downloadable JSON file.",
      "acceptanceCriteria": [
        "Admin page shows a new \"Data Transfer\" (or equivalent) card/section.",
        "Clicking \"Export\" downloads a JSON file containing the current catalog (from localStorage key `maspar_catalog`) and banner (from localStorage key `maspar_new_arrivals_banner`).",
        "Export works even when either catalog is empty or banner is not set (file still downloads with empty/null values).",
        "All user-facing text in this section is English-only and consistent with existing UI style (glassmorphism cards, theme tokens)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminDataTransfer.tsx",
          "operation": "create",
          "description": "Create a new Admin \"Data Transfer\" glassmorphism card/section that provides an Export action and renders English-only helper text. Use shadcn-ui Card/Button/Alert/Input where appropriate to match existing admin UI; Verify the component's usage instructions before implementing. Export should build a single JSON payload from localStorage keys `maspar_catalog` and `maspar_new_arrivals_banner` (tolerating missing/empty values) and trigger a browser download."
        },
        {
          "path": "frontend/src/lib/dataTransfer.ts",
          "operation": "create",
          "description": "Add frontend-only helper utilities to build an export payload from LocalStorage and trigger JSON file download (Blob + object URL), ensuring export always produces a file even when catalog is empty and/or banner is not set."
        },
        {
          "path": "frontend/src/components/admin/AdminArea.tsx",
          "operation": "modify",
          "description": "Wire the new AdminDataTransfer component into the Admin page layout as a new \"Data Transfer\" section/card, keeping the existing glassmorphism styling conventions and English-only UI copy."
        },
        {
          "path": "frontend/src/lib/uiText.ts",
          "operation": "modify",
          "description": "Add English-only UI_TEXT entries for the Admin \"Data Transfer\" section (title, description, export button label, and any helper/tooltip text) to keep copy consistent and centralized."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Add an Admin import flow to upload an exported JSON file, safely restore catalog + banner into LocalStorage, and refresh both Admin + Public Viewer UI without hard reload.",
      "acceptanceCriteria": [
        "Admin can select an exported JSON file and click \"Import\" (or equivalent) to restore data.",
        "After import completes, the Admin catalog table updates to show imported items and the Public Viewer updates to show imported items and the banner (if present) without requiring a full page reload.",
        "Import validates JSON shape safely: if the file is invalid/unparseable, show a clear English error message and do not overwrite existing data.",
        "Imported catalog items are passed through existing sanitization/migration behavior (e.g., legacy label objects, mediaType normalization) so the viewer does not break on older exports.",
        "Importing banner data uses the existing banner sync mechanism so the banner reliably appears when set.",
        "Provide an explicit confirmation prompt before overwriting current LocalStorage data (English-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminDataTransfer.tsx",
          "operation": "modify",
          "description": "Extend the Admin \"Data Transfer\" section to include an Import flow (file input + Import button), an explicit confirmation prompt before overwriting LocalStorage, and clear English-only success/error feedback. Use shadcn-ui Input/Button/Alert components to match existing admin UI; Verify the component's usage instructions before implementing. On successful import, update LocalStorage via existing in-app sync patterns (CustomEvent + storage event behavior via existing save helpers) so both Admin and Public Viewer update immediately without a hard refresh."
        },
        {
          "path": "frontend/src/lib/dataTransfer.ts",
          "operation": "modify",
          "description": "Implement safe import parsing and validation (unparseable/invalid shape must not overwrite current data). When valid, restore catalog and banner by calling existing storage modules so they broadcast in-app sync events; keep logic frontend-only and avoid any server persistence."
        },
        {
          "path": "frontend/src/lib/catalogStorage.ts",
          "operation": "modify",
          "description": "Expose a small, reusable catalog sanitization/migration helper (reusing the same logic currently applied during load) so imported catalog arrays can be normalized (legacy label objects, mediaType normalization, required field fallbacks) before saving, ensuring older exports cannot break the viewer."
        },
        {
          "path": "frontend/src/lib/uiText.ts",
          "operation": "modify",
          "description": "Add/extend English-only UI_TEXT entries for the import flow: import button label, file input label, confirmation prompt copy, invalid file/parse error copy, and success copy."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Update the Admin storage notice/help text to explain LocalStorage does not sync across links/domains/devices and Export/Import is the supported way to move data.",
      "acceptanceCriteria": [
        "Admin notice remains English-only and explicitly mentions that different sharing links can have different LocalStorage, so data may not appear automatically.",
        "The notice mentions the new Export/Import option as the workaround to move data.",
        "No Hindi text appears anywhere in the updated notice/UI copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/uiText.ts",
          "operation": "modify",
          "description": "Update UI_TEXT.admin.storageNoticeDescription (English-only) to explicitly state that LocalStorage is per browser + per link/domain/device and will not automatically sync across sharing links, and that the supported way to move data is the new Export/Import in Admin Data Transfer."
        },
        {
          "path": "frontend/src/components/admin/AdminArea.tsx",
          "operation": "modify",
          "description": "Ensure the Admin storage notice continues to display the updated English-only help copy (and remains consistent with glassmorphism/theme tokens), referencing Export/Import as the supported workaround."
        }
      ]
    }
  ]
}