{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Public Viewer media modal opening and LocalStorage media-type compatibility",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Fix Public Viewer item-card click so the MediaViewerModal reliably opens, stays open, and renders the correct viewer for image/video/pdf items.",
      "acceptanceCriteria": [
        "Clicking any item card in the Public Viewer always opens the MediaViewerModal.",
        "The modal does not immediately close after opening unless the user explicitly closes it (close button, clicking outside, or pressing Escape).",
        "The correct viewer component is rendered based on the item’s media type (image -> ImageZoomViewer, video -> VideoViewer, pdf -> PdfFirstPagePreview)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/ItemGrid.tsx",
          "operation": "modify",
          "description": "Harden item-card click handling to prevent the opening click from being interpreted as an outside click that immediately closes the modal (e.g., stop propagation / prevent default on the card click handler) while still calling onItemClick with the selected item."
        },
        {
          "path": "frontend/src/components/public/PublicViewer.tsx",
          "operation": "modify",
          "description": "Adjust modal open/close state sequencing so the dialog open action is not immediately followed by a close (e.g., ensure selectedItem is set before opening and consider deferring the open state to the next tick), and keep selectedItem stable while the modal is open."
        },
        {
          "path": "frontend/src/components/viewers/MediaViewerModal.tsx",
          "operation": "modify",
          "description": "Remove or simplify any redundant close handlers that can double-trigger (e.g., competing Escape handlers) and ensure the controlled Dialog only calls onClose on intentional close actions; keep existing viewer selection logic for image/video/pdf rendering."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Add safe LocalStorage catalog item cleanup/migration to normalize legacy/invalid mediaType and handle missing/invalid mediaSource without runtime errors.",
      "acceptanceCriteria": [
        "Items loaded from LocalStorage with `mediaType` values such as \"PDF\", \"Video\", or \"Image\" are normalized to lowercase supported values so they can open in the modal.",
        "If an item has an unsupported/unknown `mediaType`, the modal opens and shows the existing English error UI for unsupported media types (instead of failing silently).",
        "If an item has an empty/invalid `mediaSource`, the modal opens and shows the existing English error UI for missing/invalid media source (instead of failing silently).",
        "No runtime errors occur in the catalog grid or modal when encountering malformed stored items."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/catalogTypes.ts",
          "operation": "modify",
          "description": "Update catalog item typing to safely represent legacy or malformed stored values (e.g., allow mediaType to be a string at runtime while keeping the supported MediaType union) so the UI can render the existing unsupported-type error state instead of crashing."
        },
        {
          "path": "frontend/src/lib/catalogStorage.ts",
          "operation": "modify",
          "description": "Extend LocalStorage load/migration logic to sanitize stored catalog items: normalize known mediaType variants to 'image' | 'video' | 'pdf' (case-insensitive), preserve unknown mediaType strings for the modal’s unsupported-type error UI, and ensure mediaSource is a string (empty/invalid allowed) without throwing; filter/repair malformed items to prevent runtime errors and persist the migrated results back to LocalStorage."
        },
        {
          "path": "frontend/src/hooks/useCatalog.ts",
          "operation": "modify",
          "description": "Ensure catalog initialization uses the updated loadCatalog sanitation/migration results consistently (including post-cleanup/seed flows), and avoid introducing runtime errors when items contain unknown mediaType or missing mediaSource."
        },
        {
          "path": "frontend/src/components/public/ItemGrid.tsx",
          "operation": "modify",
          "description": "Make grid rendering resilient to sanitized-but-malformed items (e.g., safely render the media badge text even if mediaType is missing/unknown, and avoid rendering an <img> thumbnail when mediaSource is empty) while keeping all user-facing text in English."
        }
      ]
    }
  ]
}